import React, { Component } from 'react'
import styles from './Content.module.scss';
import GalleryGreen from'../../images/gallery1.png';
import GalleryBlue from'../../images/gallery2.png';
import GalleryRed from'../../images/gallery3.png';
import GalleryBlack from'../../images/gallery4.png';
export default class Content extends Component {
  render() {
    return (
      <div className={styles.content}>
        <p className={styles.description}><span>«Шкіряні гаманці»</span> — магазин якісних шкіряних виробів, де кожен знайде ідеальний гаманець для себе. У нас — натуральна шкіра, витончений дизайн, міцність та стиль. Великий вибір моделей: від класики до сучасних трендів, для чоловіків та жінок. Гаманці, які підкреслять ваш смак і прослужить роками! Завітайте — оберете більше, ніж гаманець!</p>
        <div className={styles.specifications}>
          {/* Содержимое раздела specifications */}
          <h2>Детальні характеристики</h2>
          <ul>
            <li>Матеріал: натуральна шкіра</li>
            <li>Розмір: 10 см x 12 см</li>
            <li>Колір: чорний</li>
            <li>Відділення для купюр: 2</li>
            <li>Відділення для карток: 8</li>
            <li>Монетниця: так</li>
          </ul>
          <h3>Повний опис</h3>
          <p>Цей шкіряний гаманець виготовлений з високоякісної натуральної шкіри, що забезпечує довговічність та стильний вигляд. Він має два відділення для купюр, вісім відділень для карток та монетницю, що робить його дуже зручним у використанні.</p>
        </div>
        <div className={styles.gallery}>
          {/* Содержимое раздела gallery */}
          <div className={styles.imageContainer}>
            <img src={GalleryGreen} alt="Зелений гаманець" />
            <p><span>Зелений гаманець</span> — це символ природності й свіжості. Його відтінки навіюють асоціації зі спокоєм і гармонією, додаючи образу унікальності. Виконаний із якісних матеріалів, він є поєднанням практичності та стилю, ідеальним вибором для тих, хто прагне виділитися та підкреслити свій смак.</p>
          </div>
          <div className={styles.imageContainer}>
            <img src={GalleryBlue} alt="Синій гаманець" />
            <p><span>Синій гаманець </span>— це втілення спокійної елегантності та гармонії. Його насичений відтінок додає витонченості, привертаючи увагу своєю стриманістю та стилем. Виконаний із якісних матеріалів, він гармонійно поєднує естетику та функціональність, стаючи універсальним аксесуаром для будь-якого випадку.</p>
          </div>
          <div className={styles.imageContainer}>
            <img src={GalleryRed} alt="Червоний гаманець" />
            <p><span>Червоний гаманець </span>— це сміливий акцент і символ енергії. Його яскравий колір притягує погляди, додаючи будь-якому образу нотку пристрасті та впевненості. Зазвичай виконаний із якісних матеріалів, він поєднує в собі елегантність і практичність. Такий аксесуар не лише функціональний, а й підкреслює індивідуальність власника.</p>
          </div>
          <div className={styles.imageContainer}>
            <img src={GalleryBlack} alt="Чорний гаманець" />
            <p><span>Чорний гаманець </span>— це втілення елегантності та практичності. Його мінімалістичний дизайн підкреслює сучасний стиль, а глибокий чорний колір додає стриманої розкоші. Зазвичай він виконаний із високоякісних матеріалів, таких як натуральна шкіра або преміальний текстиль, що робить його не лише естетичним, а й довговічним. Такий аксесуар — ідеальний баланс між функціональністю та модою, підходить до будь-якого образу.</p>
          </div>
        </div>
      </div>
    )
  }
}
